const obj  = {
    "oilList": [
        {
            "prov": "北京",
            "price": {
                "p92": "6.89",
                "p95": "7.33",
                "p98": "8.83"
            },
            "calcuPrice": {
                "p92": "",
                "p95": "",
                "p98": ""
            },
        },
        {
            "prov": "天津",
            "price": {
                "p92": "6.88",
                "p95": "7.26",
                "p98": "8.76"
            },
            "calcuPrice": {
                "p92": "",
                "p95": "",
                "p98": ""
            },
        },
        {
            "prov": "河北",
            "price": {
                "p92": "6.88",
                "p95": "7.26",
                "p98": "8.08"
            },
            "calcuPrice": {
                "p92": "",
                "p95": "",
                "p98": ""
            },
        },
        {
            "prov": "山西",
            "price": {
                "p92": "6.84",
                "p95": "7.39",
                "p98": "9.07"
            },
            "calcuPrice": {
                "p92": "",
                "p95": "",
                "p98": ""
            },
        },
        {
            "prov": "辽宁",
            "price": {
                "p92": "6.97",
                "p95": "7.46",
                "p98": "8.13"
            },
            "calcuPrice": {
                "p92": "",
                "p95": "",
                "p98": ""
            },
        },
        {
            "prov": "吉林",
            "price": {
                "p92": "6.85",
                "p95": "7.39",
                "p98": "8.05"
            },
            "calcuPrice": {
                "p92": "",
                "p95": "",
                "p98": ""
            },
        },
        {
            "prov": "黑龙江",
            "price": {
                "p92": "6.91",
                "p95": "7.37",
                "p98": "8.36"
            },
            "calcuPrice": {
                "p92": "",
                "p95": "",
                "p98": ""
            },
        },
        {
            "prov": "上海",
            "price": {
                "p92": "6.85",
                "p95": "7.29",
                "p98": "9.19"
            },
            "calcuPrice": {
                "p92": "",
                "p95": "",
                "p98": ""
            },
        },
        {
            "prov": "江苏",
            "price": {
                "p92": "6.86",
                "p95": "7.30",
                "p98": "9.35"
            },
            "calcuPrice": {
                "p92": "",
                "p95": "",
                "p98": ""
            },
        },
        {
            "prov": "浙江",
            "price": {
                "p92": "6.86",
                "p95": "7.30",
                "p98": "8.80"
            },
            "calcuPrice": {
                "p92": "",
                "p95": "",
                "p98": ""
            },
        },
        {
            "prov": "安徽",
            "price": {
                "p92": "6.85",
                "p95": "7.35",
                "p98": "8.85"
            },
            "calcuPrice": {
                "p92": "",
                "p95": "",
                "p98": ""
            },
        },
        {
            "prov": "福建",
            "price": {
                "p92": "6.86",
                "p95": "7.32",
                "p98": "8.82"
            },
            "calcuPrice": {
                "p92": "",
                "p95": "",
                "p98": ""
            },
        },
        {
            "prov": "江西",
            "price": {
                "p92": "6.85",
                "p95": "7.35",
                "p98": "8.85"
            },
            "calcuPrice": {
                "p92": "",
                "p95": "",
                "p98": ""
            },
        },
        {
            "prov": "山东",
            "price": {
                "p92": "6.85",
                "p95": "7.35",
                "p98": "8.35"
            },
            "calcuPrice": {
                "p92": "",
                "p95": "",
                "p98": ""
            },
        },
        {
            "prov": "湖北",
            "price": {
                "p92": "6.89",
                "p95": "7.38",
                "p98": "9.37"
            },
            "calcuPrice": {
                "p92": "",
                "p95": "",
                "p98": ""
            },
        },
        {
            "prov": "湖南",
            "price": {
                "p92": "6.84",
                "p95": "7.27",
                "p98": "8.47"
            },
            "calcuPrice": {
                "p92": "",
                "p95": "",
                "p98": ""
            },
        },
        {
            "prov": "河南",
            "price": {
                "p92": "6.89",
                "p95": "7.36",
                "p98": "8.01"
            },
            "calcuPrice": {
                "p92": "",
                "p95": "",
                "p98": ""
            },
        },
        {
            "prov": "海南",
            "price": {
                "p92": "8.00",
                "p95": "8.49",
                "p98": "9.49"
            },
            "calcuPrice": {
                "p92": "",
                "p95": "",
                "p98": ""
            },
        },
        {
            "prov": "重庆",
            "price": {
                "p92": "6.96",
                "p95": "7.35",
                "p98": "8.88"
            },
            "calcuPrice": {
                "p92": "",
                "p95": "",
                "p98": ""
            },
        },
        {
            "prov": "广东",
            "price": {
                "p92": "6.91",
                "p95": "7.48",
                "p98": "9.48"
            },
            "calcuPrice": {
                "p92": "",
                "p95": "",
                "p98": ""
            },
        },
        {
            "prov": "广西壮族自治区",
            "price": {
                "p92": "6.95",
                "p95": "7.51",
                "p98": "8.76"
            },
            "calcuPrice": {
                "p92": "",
                "p95": "",
                "p98": ""
            },
        },
        {
            "prov": "宁夏回族自治区",
            "price": {
                "p92": "6.79",
                "p95": "7.18",
                "p98": "8.21"
            },
            "calcuPrice": {
                "p92": "",
                "p95": "",
                "p98": ""
            },
        },
        {
            "prov": "甘肃",
            "price": {
                "p92": "6.88",
                "p95": "7.34",
                "p98": "7.91"
            },
            "calcuPrice": {
                "p92": "",
                "p95": "",
                "p98": ""
            },
        },
        {
            "prov": "新疆维吾尔族自治区",
            "price": {
                "p92": "6.68",
                "p95": "7.15",
                "p98": "7.99"
            },
            "calcuPrice": {
                "p92": "",
                "p95": "",
                "p98": ""
            },
        },
        {
            "prov": "呼和浩特市",
            "price": {
                "p92": "6.82",
                "p95": "7.28",
                "p98": "7.99"
            },
            "calcuPrice": {
                "p92": "",
                "p95": "",
                "p98": ""
            },
        },
        {
            "prov": "成都",
            "price": {
                "p92": "6.99",
                "p95": "7.47",
                "p98": "8.11"
            },
            "calcuPrice": {
                "p92": "",
                "p95": "",
                "p98": ""
            },
        },
        {
            "prov": "贵阳",
            "price": {
                "p92": "7.01",
                "p95": "7.41",
                "p98": "8.41"
            },
            "calcuPrice": {
                "p92": "",
                "p95": "",
                "p98": ""
            },
        },
        {
            "prov": "昆明",
            "price": {
                "p92": "7.03",
                "p95": "7.55",
                "p98": "8.23"
            },
            "calcuPrice": {
                "p92": "",
                "p95": "",
                "p98": ""
            },
        },
        {
            "prov": "西安",
            "price": {
                "p92": "6.78",
                "p95": "7.16",
                "p98": "9.39"
            },
            "calcuPrice": {
                "p92": "",
                "p95": "",
                "p98": ""
            },
        },
        {
            "prov": "西宁",
            "price": {
                "p92": "6.84",
                "p95": "7.33",
                "p98": "7.99"
            },
            "calcuPrice": {
                "p92": "",
                "p95": "",
                "p98": ""
            },
        }
    ],
    "calcuOilChange": "",
    "oilChange": "-70",
    "lastUpdateTs": ""
}



// 历次调整幅度
const modData = [
  {date: '2024-05-30', num: 0},   {date: '2024-06-14', num: -190},  {date: '2024-06-28', num: 210},
  {date: '2024-07-12', num: 110}, {date: '2024-07-26', num: -145},  {date: '2024-08-09', num: -305},
  {date: '2024-08-23', num: 0},   {date: '2024-09-06', num: -100},  {date: '2024-09-21', num: -365},
  {date: '2024-10-11', num: 140}, {date: '2024-10-24', num: 90},    {date: '2024-11-07', num: -145},
  {date: '2024-12-05', num: 0},   {date: '2024-12-19', num: 0},     {date: '2025-01-03', num: 70},
  {date: '2025-01-17', num: 340}, {date: '2025-02-07', num: 0},     {date: '2025-02-20', num: -170},
  {date: '2025-03-06', num: -135},{date: '2025-03-20', num: -280},  {date: '2025-04-03', num: 230},
  {date: '2025-04-18', num: -480},{date: '2025-05-01', num: 0},     {date: '2025-05-20', num: -230},
  {date: '2025-06-04', num: 65},  {date: '2025-06-18', num: 260},   {date: '2025-07-02', num: 235},
  {date: '2025-07-16', num: -130},{date: '2025-07-30', num: 0},     {date: '2025-08-13', num: 0},
  {date: '2025-08-27', num: -180},{date: '2025-09-10', num: 0},     {date: '2025-09-24', num: 0},
  {date: '2025-10-14', num: -75}, {date: '2025-10-28', num: -265},  {date: '2025-11-11', num: 125},
  {date: '2025-11-25', num: -70}, {date: '2025-12-09', num: -55}
]

const priceMap = {
  '广东': {
    '2025-06-04': {p92: 6.99, p95: 7.57, p98: 9.57}, '2025-06-18': {p92: 7.19, p95: 7.79, p98: 9.79},
    '2025-07-02': {p92: 7.38, p95: 8.00, p98: 10.00}, '2025-07-16': {p92: 7.28, p95: 7.89, p98: 9.89},
    '2025-07-30': {p92: 7.28, p95: 7.89, p98: 9.89}, '2025-08-13': {p92: 7.28, p95: 7.89, p98: 9.89},
    '2025-08-27': {p92: 7.13, p95: 7.73, p98: 9.73}, '2025-09-10': {p92: 7.13, p95: 7.73, p98: 9.73},
    '2025-09-24': {p92: 7.13, p95: 7.73, p98: 9.73}, '2025-10-14': {p92: 7.07, p95: 7.66, p98: 9.66},
    '2025-10-28': {p92: 6.86, p95: 7.43, p98: 9.43}, '2025-11-11': {p92: 6.96, p95: 7.54, p98: 9.54},
    '2025-11-25': {p92: 6.91, p95: 7.48, p98: 9.48}, '2025-12-09': {p92: 6.86, p95: 7.43, p98: 9.43},
  },
  '山东': {
    '2025-06-04': {p92: 6.93, p95: 7.44, p98: 8.44}, '2025-06-18': {p92: 7.14, p95: 7.66, p98: 8.66},
    '2025-07-02': {p92: 7.33, p95: 7.86, p98: 8.86}, '2025-07-16': {p92: 7.22, p95: 7.75, p98: 8.75},
    '2025-07-30': {p92: 7.22, p95: 7.75, p98: 8.75}, '2025-08-13': {p92: 7.22, p95: 7.75, p98: 8.75},
    '2025-08-27': {p92: 7.08, p95: 7.59, p98: 8.59}, '2025-09-10': {p92: 7.08, p95: 7.59, p98: 8.59},
    '2025-09-24': {p92: 7.08, p95: 7.59, p98: 8.59}, '2025-10-14': {p92: 7.02, p95: 7.53, p98: 8.53},
    '2025-10-28': {p92: 6.81, p95: 7.30, p98: 8.30}, '2025-11-11': {p92: 6.91, p95: 7.41, p98: 8.41},
    '2025-11-25': {p92: 6.85, p95: 7.35, p98: 8.35}, '2025-12-09': {p92: 6.81, p95: 7.30, p98: 8.30},
  }

}




const init = async (prov) => {
  let rawOil = dataMap.data[prov]
  let start = false
  const obj = {}
  for (let i = 0; i < modData.length; i ++) {
    const modItem = modData[i]
    rawOil += modItem.num
    if (modItem.date === '2025-06-04') start = true
    if (start === false) continue
    const priceItem = priceMap[prov][modItem.date]
    if (!priceItem) throw new Error('出错了', modItem.date)
    const preIdx = i -1
    const preModItem = modData[preIdx]
    const prePriceItem = priceMap[prov][preModItem.date]
    if (!prePriceItem) continue
    if (modItem.num === 0) continue
    
    obj[modItem.date] = { rawOil: rawOil, change: modItem.num }
    let arr = ['p98', 'p95', 'p92']
    while(arr.length) {
      const pKey = arr.pop()
      let range = mathjs.subtract(mathjs.bignumber(priceItem[pKey]), mathjs.bignumber(prePriceItem[pKey]))
      range = mathjs.bignumber(Math.abs(range))
      const n5 = mathjs.bignumber(modItem.num / 5)
      const preN5Price = mathjs.format(mathjs.divide(range, mathjs.bignumber(Math.abs(n5))), {notation: 'fixed', precision: 3})

      let tmp = mathjs.multiply(mathjs.bignumber(n5), mathjs.bignumber(0.0045))
      
      let calcuPrice = mathjs.add(mathjs.bignumber(prePriceItem[pKey]), mathjs.bignumber(tmp))
      calcuPrice = mathjs.format(calcuPrice, {notation: 'fixed', precision: 2})

      obj[modItem.date][pKey] = { n5,preN5Price, price: priceItem[pKey], calcuPrice, tmp, prePrice:  prePriceItem[pKey]}
    }
  }
  console.log(obj)
}

// init('山东')


const getAllModPriceDays = async  () => { // 获取所有调价日
  const list = util.getYearWorkdays(2025)
  let date = '2025-01-02'
  let num = 0
  const modList = []
  let start = false
  for (let i = 0; i < list.length; i ++) {
    const item = list[i]
    if (item === date) {
      num = 0
      modList.push(item)
      start = true
      continue
    }
    if (start === false) continue
    num += 1
    // console.log(item)
    if (num === 10) {
      modList.push(item)
      num = 0
      // break
    }
  }
  console.log(modList)
}

// getAllModPriceDays()

{"oilList":[{"prov":"青海省","price":{"p89":"","p92":"","p95":"","p98":"","p0":""},"calcuPrice":{"p89":"","p92":"","p95":"","p98":"","p0":""}},{"prov":"西藏","price":{"p89":"","p92":"","p95":"","p98":"","p0":""},"calcuPrice":{"p89":"","p92":"","p95":"","p98":"","p0":""}},{"prov":"广西","price":{"p89":"","p92":"","p95":"","p98":"","p0":""},"calcuPrice":{"p89":"","p92":"","p95":"","p98":"","p0":""}},{"prov":"新疆","price":{"p89":"","p92":"","p95":"","p98":"","p0":""},"calcuPrice":{"p89":"","p92":"","p95":"","p98":"","p0":""}},{"prov":"宁夏","price":{"p89":"","p92":"","p95":"","p98":"","p0":""},"calcuPrice":{"p89":"","p92":"","p95":"","p98":"","p0":""}},{"prov":"内蒙古","price":{"p89":"","p92":"","p95":"","p98":"","p0":""},"calcuPrice":{"p89":"","p92":"","p95":"","p98":"","p0":""}},{"prov":"甘肃省","price":{"p89":"","p92":"","p95":"","p98":"","p0":""},"calcuPrice":{"p89":"","p92":"","p95":"","p98":"","p0":""}},{"prov":"陕西省","price":{"p89":"","p92":"","p95":"","p98":"","p0":""},"calcuPrice":{"p89":"","p92":"","p95":"","p98":"","p0":""}},{"prov":"云南省","price":{"p89":"","p92":"","p95":"","p98":"","p0":""},"calcuPrice":{"p89":"","p92":"","p95":"","p98":"","p0":""}},{"prov":"贵州省","price":{"p89":"","p92":"","p95":"","p98":"","p0":""},"calcuPrice":{"p89":"","p92":"","p95":"","p98":"","p0":""}},{"prov":"四川省","price":{"p89":"","p92":"","p95":"","p98":"","p0":""},"calcuPrice":{"p89":"","p92":"","p95":"","p98":"","p0":""}},{"prov":"海南省","price":{"p89":"","p92":"","p95":"","p98":"","p0":""},"calcuPrice":{"p89":"","p92":"","p95":"","p98":"","p0":""}},{"prov":"广东省","price":{"p89":"","p92":"","p95":"","p98":"","p0":""},"calcuPrice":{"p89":"","p92":"","p95":"","p98":"","p0":""}},{"prov":"湖南省","price":{"p89":"","p92":"","p95":"","p98":"","p0":""},"calcuPrice":{"p89":"","p92":"","p95":"","p98":"","p0":""}},{"prov":"湖北省","price":{"p89":"","p92":"","p95":"","p98":"","p0":""},"calcuPrice":{"p89":"","p92":"","p95":"","p98":"","p0":""}},{"prov":"河南省","price":{"p89":"","p92":"","p95":"","p98":"","p0":""},"calcuPrice":{"p89":"","p92":"","p95":"","p98":"","p0":""}},{"prov":"山东省","price":{"p89":"","p92":"","p95":"","p98":"","p0":""},"calcuPrice":{"p89":"","p92":"","p95":"","p98":"","p0":""}},{"prov":"江西省","price":{"p89":"","p92":"","p95":"","p98":"","p0":""},"calcuPrice":{"p89":"","p92":"","p95":"","p98":"","p0":""}},{"prov":"福建省","price":{"p89":"","p92":"","p95":"","p98":"","p0":""},"calcuPrice":{"p89":"","p92":"","p95":"","p98":"","p0":""}},{"prov":"安徽省","price":{"p89":"","p92":"","p95":"","p98":"","p0":""},"calcuPrice":{"p89":"","p92":"","p95":"","p98":"","p0":""}},{"prov":"浙江省","price":{"p89":"","p92":"","p95":"","p98":"","p0":""},"calcuPrice":{"p89":"","p92":"","p95":"","p98":"","p0":""}},{"prov":"江苏省","price":{"p89":"","p92":"","p95":"","p98":"","p0":""},"calcuPrice":{"p89":"","p92":"","p95":"","p98":"","p0":""}},{"prov":"黑龙江省","price":{"p89":"","p92":"","p95":"","p98":"","p0":""},"calcuPrice":{"p89":"","p92":"","p95":"","p98":"","p0":""}},{"prov":"吉林省","price":{"p89":"","p92":"","p95":"","p98":"","p0":""},"calcuPrice":{"p89":"","p92":"","p95":"","p98":"","p0":""}},{"prov":"辽宁省","price":{"p89":"","p92":"","p95":"","p98":"","p0":""},"calcuPrice":{"p89":"","p92":"","p95":"","p98":"","p0":""}},{"prov":"山西省","price":{"p89":"","p92":"","p95":"","p98":"","p0":""},"calcuPrice":{"p89":"","p92":"","p95":"","p98":"","p0":""}},{"prov":"河北省","price":{"p89":"","p92":"","p95":"","p98":"","p0":""},"calcuPrice":{"p89":"","p92":"","p95":"","p98":"","p0":""}},{"prov":"重庆市","price":{"p89":"","p92":"","p95":"","p98":"","p0":""},"calcuPrice":{"p89":"","p92":"","p95":"","p98":"","p0":""}},{"prov":"上海市","price":{"p89":"","p92":"","p95":"","p98":"","p0":""},"calcuPrice":{"p89":"","p92":"","p95":"","p98":"","p0":""}},{"prov":"天津市","price":{"p89":"","p92":"","p95":"","p98":"","p0":""},"calcuPrice":{"p89":"","p92":"","p95":"","p98":"","p0":""}},{"prov":"北京市","price":{"p89":"","p92":"","p95":"","p98":"","p0":""},"calcuPrice":{"p89":"","p92":"","p95":"","p98":"","p0":""}}],"calcuOilChange":"","oilChange":"","lastUpdateTs":""}